# Задача №344. Перевод числа
# Входные данные
# Вводится натуральное число, записанное в двоичной системе.

# Выходные данные
# Выведите число, записанное в десятичной системе.
print(int(input(), 2))