# Задача №3059. Список степеней двойки
# Входные данные
# Вводится натуральное число.

# Выходные данные
# Выведите ответ на задачу.

x = int(input())
i = 1
while i <= x:
    print(i, end=' ')
    i *= 2