# Задача №292. Максимум из двух чисел
# Входные данные
# Даны два целых числа, каждое число записано в отдельной строке.

# Выходные данные
# Выведите наибольшее из данных чисел.

a, b = int(input()), int(input())
print(max(a, b))