v, t = int(input()), int(input())
s = v * t
print(-((s // 109) * 109 - s))


# Задача №2940. МКАД
# Длина Московской кольцевой автомобильной дороги —109 километров. 
# Байкер Вася стартует с нулевого километра МКАД и едет со скоростью v километров в час. 
# На какой отметке он остановится через t часов?